import { Q1, Q2, Q3, Q4, Q5, Q6, Q7, Q8 } from "./asset";

const quizData = [
    {
        title: "1",
        icon: Q1,
        question: "為了尋找回去的方法，你開始往前探索。你覺得前方可能會遇到...",
        options: [
            {
                text: '埋藏在森林深處的寶藏',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 10, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '賜予智慧與能力的精靈',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 10, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '回答各種問題的智者',
                score: {
                    A: 0, // 獼猴
                    B: 10, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },

        ],
    },
    {
        title: "2",
        icon: Q2,
        question: "在森林裡走了好長一段時間，還是沒有任何發現。你開始擔心明天的行程會被耽誤...",
        options: [
            {
                text: '好不容易預約到的設計師',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 10, // 孔雀
                }
            },
            {
                text: '跟朋友約好的畢業旅行',
                score: {
                    A: 10, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '奶奶的六十歲大壽',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 15, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "3",
        icon: Q3,
        question: "遇見了一隻昏倒在山洞前的小梅花鹿，你會怎麼做？",
        options: [
            {
                text: '先帶牠走再一邊尋找救治的資源',
                score: {
                    A: 10, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '判斷是否有幫助牠的能力或裝備',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 5, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '避免節外生枝還是不要輕舉妄動',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 10, // 棕熊
                    F: 5, // 孔雀
                }
            },

        ],
    },
    {
        title: "4",
        icon: Q4,
        question: "終於看見山洞出口，前方有腳步聲朝你走來，你覺得會是...",
        options: [
            {
                text: '兇猛的蛤蟆怪',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 3, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '迷路的小精靈',
                score: {
                    A: 5, // 獼猴
                    B: 0, // 鯊魚
                    C: 5, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '友善指引方向的香菇精',
                score: {
                    A: 0, // 獼猴
                    B: 5, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },

        ],
    },

    {
        title: "5",
        icon: Q5,
        question: "眼前一片清澈的湖水，旁邊立牌寫著「許願池」。你願意投入什麼作為許願的代價？",
        options: [
            {
                text: '背包裡僅存的食物',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: -10, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '祖傳的玉珮',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: -10, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '跟朋友的交換日記',
                score: {
                    A: -10, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "6",
        icon: Q6,
        question: "一位美麗的湖中女神真的出現，為了幫助你更順利地在這座森林中探索，你選擇...",
        options: [
            {
                text: '變得更強大，遇到野獸或險峻的路都不需懼怕',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 10, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '值得信任的夥伴，與你一起面對前方的未知',
                score: {
                    A: 5, // 獼猴
                    B: 0, // 鯊魚
                    C: 5, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '告訴你，你來到這座森林的原因',
                score: {
                    A: 0, // 獼猴
                    B: 10, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "7",
        icon: Q7,
        question: "道別湖中女神後，你繼續前行，發現空無一人的小木屋，裡面有...",
        options: [
            {
                text: '豐盛的食物',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 10, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '乾淨的浴室',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 15, // 孔雀
                }
            },
            {
                text: '溫馨的沙發',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 10, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "8",
        icon: Q8,
        question: "混亂過後，森林某處傳來了音樂與歌聲，彷彿萬物甦醒，可能會是？",
        options: [
            {
                text: '通往家裡的傳送門',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 10, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '森林動物們在開趴',
                score: {
                    A: 10, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '你擅長的才藝大賽',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 5, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
];

export default quizData;
