
const quizData = [
    {
        title: "Question_01",
        question: "震驚過後，你試圖理解發生了什麼事，你會先...",
        // image: quizImg01,
        options: [
            {
                text: '確認自己的模樣，是否還是原來的自己',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 10, // 孔雀
                }
            },
            {
                text: '檢查身上的背包，是否有可使用的裝備',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 1, // 翠鳥
                    E: 3, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '觀察周遭的環境，是否有相關的線索',
                score: {
                    A: 0, // 獼猴
                    B: 3, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },

        ],
    },
    {
        title: "Question_02",
        question: "你想起一件重要的事，得趕快回到原來的世界才行，那是...",
        options: [
            {
                text: '能力檢測的證照考試',
                score: {
                    A: 0, // 獼猴
                    B: 1, // 鯊魚
                    C: 0, // 狐蒙
                    D: 3, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '跟同學約好要做報告',
                score: {
                    A: 10, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '父母交代要完成的事',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 10, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },

        ],
    },
    {
        title: "Question_03",
        question: "你決心要找到離開的路，開始往前探索，你覺得前方會遇到...",
        options: [
            {
                text: '埋藏在森林深處的寶藏',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 10, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '賜予智慧與能力的精靈',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 10, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '回答各種問題的智者',
                score: {
                    A: 0, // 獼猴
                    B: 10, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "Question_04",
        question: "來到山洞前，一隻梅花鹿趴臥在洞口，牠非常口渴而向你要水喝，你會怎麼做？",
        options: [
            {
                text: '把背包裡的水給牠',
                score: {
                    A: 3, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '告訴牠溪水的方向',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 1, // 翠鳥
                    E: 1, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '裝作沒看到直接經過',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 1, // 棕熊
                    F: 1, // 孔雀
                }
            },

        ],
    },
    {
        title: "Question_05",
        question: "在山洞裡摸黑走了一陣子，終於看見出口的亮光，這時聽見有腳步聲朝你走來，你覺得會是...",
        options: [
            {
                text: '兇猛的野獸',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 1, // 翠鳥
                    E: 1, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '同樣迷路的旅人',
                score: {
                    A: 3, // 獼猴
                    B: 0, // 鯊魚
                    C: 3, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '友善指引方向的香菇精',
                score: {
                    A: 0, // 獼猴
                    B: 10, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },

        ],
    },

    {
        title: "Question_06",
        question: "一大片清澈的湖水印入眼簾，旁邊立牌寫著「許願池」，你願意投入什麼作為許願的代價？",
        options: [
            {
                text: '身上所有的錢',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: -10, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '家人送你的手錶',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: -10, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: -3, // 孔雀
                }
            },
            {
                text: '跟朋友們一起去買的潮帽',
                score: {
                    A: -10, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: -3, // 孔雀
                }
            },
        ],
    },
    {
        title: "Question_07",
        question: "一位美麗的湖中女神真的出現，為了幫助你更順利地在這座森林中探索，你選擇...",
        options: [
            {
                text: '變得更強大，遇到野獸或險峻的路都不需懼怕',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 10, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '值得信任的夥伴，陪伴你、與你一起面對未知',
                score: {
                    A: 5, // 獼猴
                    B: 0, // 鯊魚
                    C: 5, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '告訴你，你來到這座森林的原因',
                score: {
                    A: 0, // 獼猴
                    B: 10, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "Question_08",
        question: "道別湖中女神後，你繼續前行，發現空無一人的小木屋，裡面有...",
        options: [
            {
                text: '豐盛的食物',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 10, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '一塵不染的鏡子',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 20, // 孔雀
                }
            },
            {
                text: '溫馨的沙發',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 10, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "Question_09",
        question: "打開後門出去，外面有著絕景雲海，伴隨著金黃色的夕陽，十分美麗...",
        options: [
            {
                text: '「要是發到IG上一定會有很多人來問這是哪裡！」',
                score: {
                    A: 3, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 3, // 孔雀
                }
            },
            {
                text: '「或許來到這裡就是為了讓我看見這副景色吧！」',
                score: {
                    A: 0, // 獼猴
                    B: 10, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '「這裡完全不輸觀光勝地，來這一趟其實挺賺的嘛！」',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 10, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "Question_10",
        question: "突然一陣天搖地動，森林裡似乎發生了巨變，此時你會擔心...",
        options: [
            {
                text: '自己能否回去',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 3, // 翠鳥
                    E: 0, // 棕熊
                    F: 3, // 孔雀
                }
            },
            {
                text: '這座森林的未來',
                score: {
                    A: 0, // 獼猴
                    B: 3, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 3, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '洞穴前的那頭鹿',
                score: {
                    A: 3, // 獼猴
                    B: 0, // 鯊魚
                    C: 3, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
    {
        title: "Question_11",
        question: "混亂過後，森林某處傳來了音樂與歌聲，彷彿萬物甦醒，可能會是？",
        options: [
            {
                text: '親子共遊的野餐會',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 10, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '人聲鼎沸的森友會',
                score: {
                    A: 10, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 0, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
            {
                text: '藏龍臥虎的才藝大賽',
                score: {
                    A: 0, // 獼猴
                    B: 0, // 鯊魚
                    C: 0, // 狐蒙
                    D: 10, // 翠鳥
                    E: 0, // 棕熊
                    F: 0, // 孔雀
                }
            },
        ],
    },
];

export default quizData;
