import { Result01, Result02, Result03, Result04, Result05, Result06, ShareResult01, ShareResult02, ShareResult03, ShareResult04, ShareResult05, ShareResult06 } from "./asset";

const resultData = [
    {
        // Score A
        title: "顯眼包獼猴",
        type: "人際焦慮",
        description: [
            "在暗潮洶湧的猴子社會中，要獲得甜美的果實及眾星拱月的地位，你無法自立為王，作為一隻專業的山道猴子必須要廣結善緣，確定你結交的朋友們在關鍵時刻會挺你一波。",
            "有時為了得到朋友們的支持，你付出了太多甚至犧牲自己，實在是太焦慮了..."
        ],
        invite: [
            "意識人群的你，就像獼猴一樣，成長過程中需要許多夥伴的支持。Zootopia跟你分享與人相處的自我底線，一起尋找絕對會挺你到底的好夥伴吧！"
        ],
        hashtag: [
            "不揪～欸",
            "確實ss",
            "都行"
        ],
        img: Result01,
        shareImg: ShareResult01,
    },
    {
        // Score B
        title: "謎之格陵蘭鯊",
        type: "生涯焦慮",
        description: [
            "漫遊在冰冷的北極海，時間在這裡過得很慢。與其他短壽種相比，有五百年以上壽命的你，不用被時光追趕，在這裡靜靜度過每時每刻，擁有更多思考與觀察歲月流逝的機會。",
            "人生一直無法找到最全面的解答，實在是太焦慮了..."
        ],
        invite: [
            "追尋人生意義的你，就像格陵蘭鯊一樣，渴望找到活著的意義，Zootopia與你一起找尋更明確的方向。"
        ],
        hashtag: [
            "為什麼",
            "大器晚成",
            "哈哈這我"
        ],
        img: Result02,
        shareImg: ShareResult02,
    },
    {
        // Score C
        title: "孝子狐蒙",
        type: "家庭期望",
        description: [
            "身為龐大狐蒙家族的一員，你的生活一切必須由家族首領來決斷，只要一日待在家族中，你就要為了榮譽而戰，貢獻你的力量與生命，你很難有自主權。",
            "在家庭與校園社交總無法選擇自己想要的，又怕不能完成自己的夢想，實在是太焦慮了…"
        ],
        invite: [
            "總是想符合父母期待的你，就像狐蒙一樣，似乎永遠不夠好，真是壓力山大，Zootopia與你分享正確認知，換個方法解除魔咒、解鎖嶄新人生地圖。"
        ],
        hashtag: [
            "為什麼",
            "大器晚成",
            "哈哈這我"
        ],
        img: Result03,
        shareImg: ShareResult03,
    },
    {
        // Score D
        title: "有料翠鳥",
        type: "能力焦慮",
        description: [
            "離巢後的第四天，你就要鍛鍊自己成為潛水捕魚大師，為了掌握暢遊水下世界的技巧，無數的同伴從此沒再浮上來，但唯有掌握生存能力，你才有資格真正展開屬於你的人生。",
            "雖然有很多看似可行的辦法，但活下來真的好難，想躺平，實在是太焦慮了…"
        ],
        invite: [
            "努力追求能力的你，渴望擁有像翠鳥一樣精準到位的生存技巧，Zootopia將說服你，你很優秀！我們一起穩定發揮吧！"
        ],
        hashtag: [
            "要確～欸",
            "完美主義",
            "捲王"
        ],
        img: Result04,
        shareImg: ShareResult04,
    },
    {
        // Score E
        title: "干飯人棕熊",
        type: "經濟焦慮",
        description: [
            "為了擁有傲視群雄的體格、厚實的毛皮以及入冬時的脂肪儲備，你必須對地盤裡長出的每一顆果實、溪裡游過的魚精打細算。必要時，你也會用大聲咆哮與尖牙利爪提醒你的競爭對手們，我在這！",
            "不過，汲汲營營的生活偶爾也讓你感到疲憊，一輩子都要這樣嗎？實在是太焦慮了…"
        ],
        invite: [
            "追求財務自由的你，就像棕熊一樣，誓死捍衛自己所擁有的一切，你所追求的，真的是你要的嗎？Zootopia跟你說說更多有價值的事物！"
        ],
        hashtag: [
            "你不理財，財不理你",
            "這個有打折嗎",
            "請詳閱公開說明書"
        ],
        img: Result05,
        shareImg: ShareResult05,
    },
    {
        // Score F
        title: "活網仔孔雀",
        type: "容貌焦慮",
        description: [
            "在敵人或愛人面前，你的一生都要用來美麗，也必須美麗。鮮豔如珠寶般的羽毛，象徵你的優秀的身手與豐厚的資本，是傾盡一切代價換得的榮耀。",
            "華麗的背後，所需付出的成本真的好多、好累，實在是太焦慮了…"
        ],
        invite: [
            "華麗的你，就像孔雀一樣總是保持美麗、保持帥哥，Zootopia讓你看看什麼是內外兼具的華麗代言人！"
        ],
        hashtag: [
            "死了都要美",
            "不要拍我，我素顏",
            "這張太醜了，刪掉"
        ],
        img: Result06,
        shareImg: ShareResult06,
    },
]


export default resultData;