// import { Result01, Result02, Result03, Result04, Result05 } from "../asset";

const resultData = [
    {
        // Score A
        title: "顯眼包獼猴",
        type: "人際焦慮",
        description: [
            "在暗潮洶湧的猴子社會中，要獲得甜美的漿果或眾星拱月的地位，你一定無法獨自。",
            "作為一隻專業的山道猴子就是要廣結善緣，確定你結交的兄弟姐妹們在關鍵時刻會挺你一波～"
        ],
        invite: [
            "意識群眾的你，就像獼猴一樣在"
        ],
        hashtag: [
            "搭子",
        ],
        // img: ,
    },
    {
        // Score B
        title: "格陵蘭鯊",
        type: "生涯焦慮",
        description: [
            "漫遊在冰冷的北極海，時間在這裡過得很慢。",
            "與其他短壽種相比，不用被時光追趕的你，在這裡靜靜度過每時每刻，擁有更多思考與觀察歲月流逝的機會。"
        ],
        invite: [
            "一直在追尋人生意義的你，不如像活了五百年的格陵蘭鯊一般，多看看"
        ],
        hashtag: [
            "我是誰，我在哪",
        ],
        // img: ,
    },
    {
        // Score C
        title: "狐蒙",
        type: "家庭期望",
        description: [
            "身為龐大家族的一員，你的生活一切必須由家族首領-你的親生母親來決斷～",
            "只要一日待在家族中，你就沒有戀愛與生兒育女的自由，並且得在打造地道、養育弟妹與地盤之爭中貢獻你的力量與性命。"
        ],
        invite: [
            "在家庭當中，你通常希望符合父母的期待而行，"
        ],
        hashtag: [
            "Keyword",
        ],
        // img: ,
    },
    {
        // Score D
        title: "有料翠鳥",
        type: "能力焦慮",
        description: [
            "離巢後的第四天，你就要展開成為潛水捕魚客的艱辛過程。",
            "為了掌握穿行水下世界的技巧，無數的同伴從此沒再浮上來，但唯有掌握捕魚技能，你才有資格獲得生命、未來的伴侶與後代。"
        ],
        invite: [
            "努力追求能力的你，渴望擁有像翠鳥一樣精準到位的生存技巧",
            "知識或技術的能力或許可以做到很多，但與人之間溝通的可以發揮更大的力量"
        ],
        hashtag: [
            "沒技術還不是渣",
            "卷王"
        ],
        // img: ,
    },
    {
        // Score E
        title: "干飯人棕熊",
        type: "經濟焦慮",
        description: [
            "為了擁有傲視群雄的體格、厚實的毛皮以及入冬時的脂肪儲備，你必須對地盤裡長出的每一顆漿果、溪裡游過的魚精打細算。",
            "必要時，你也會用大聲咆哮與尖牙利爪提醒你的競爭對手們。"
        ],
        invite: [

        ],
        hashtag: [
            "你不理財，財不理你",
            "錢不是萬能，但沒錢萬萬不能",
            "這個有打折嗎"
        ],
        // img: ,
    },
    {
        // Score F
        title: "活網仔孔雀",
        type: "容貌焦慮",
        description: [
            "在敵人面前，或在愛人面前，你的一生都要用來美麗，也必須美麗。",
            "鮮豔如珠寶般的羽毛，象徵你的優秀的身手與豐厚的資本，是傾盡一切代價換得的榮耀。"
        ],
        invite: [
            "內心住著天使，永遠比天使的外表更能打動人"
        ],
        hashtag: [
            "鏡子照到都要破了",
            "魔鏡啊魔鏡",
            "不要拍我，我素顏",
            "這張太醜了，刪掉"
        ],
        // img: ,
    },
]


export default resultData;